---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ElemRoomId
source: html/7d4ccf76-778f-d185-ffac-7cce97c1b1e0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ElemRoomId Property

"Room Id"

## Syntax (C#)
```csharp
public static ForgeTypeId ElemRoomId { get; }
```